"""

問題文
縦 
H 行、横 
W 列 のマス目があります。 高橋くんは、このマス目のそれぞれのマスを白か黒で塗ろうとしています。

高橋くんは、マス目に含まれるマスのうち端にあるマスをすべて黒く塗り、それ以外のマスを白く塗ります。 高橋くんが色を塗ったあとのマス目を出力してください。

より厳密には
制約
3≤H≤10
3≤W≤10
入力はすべて整数
入力
入力は以下の形式で標準入力から与えられる。

H 
W
出力
H 行にわたって、長さ 
W の文字列を出力せよ。 
i 行目 
(1≤i≤H) の 
j 文字目 
(1≤j≤W) には、マス 
(i,j) が黒く塗られているなら # 、白く塗られているなら . を出力せよ。

入力例 1
Copy
4 5
出力例 1
Copy
#####
#...#
#...#
#####
例えば、マス 
(1,1) は端にあります。 マス 
(1,1) と辺で隣接しているマスはマス 
(1,2) とマス 
(2,1) の 
2 個のみだからです。 よって、マス 
(1,1) は黒く塗られるので、
1 行目の 
1 文字目には # を出力してください。

逆に、例えばマス 
(3,4) は端にありません。 マス 
(3,4) と辺で隣接しているマスはマス 
(2,4), マス 
(3,3), マス 
(3,5), マス 
(4,4) の 
4 個だからです。 よって、マス 
(3,4) は白く塗られるので、
3 行目の 
4 文字目には . を出力してください。

入力例 2
Copy
5 6
出力例 2
Copy
######
#....#
#....#
#....#
######

"""

# 方針
"""
まずH,Wが条件に適合するかを確認。
1行目とH行目はすべて#。#は計W個。
2行目からH-1行目までは、1文字目とW文字目が#で、2文字目からW-1文字目までは.。#は計2個、.は計W-2個。
"""

H,W = map(int, input().strip().split())

if H < 3 or H > 10 or W < 3 or W > 10:
    exit()

for i in range(H):
    for j in range(W):
        if i == 0 or i == H-1 or j == 0 or j == W-1:
            print('#', end='')
        else:
            print('.', end='')
    print()

